## Data Pipeline Steps
1. Data Extraction
2. Quality Assessment
3. Data cleaning/transformation
4. Data Validation (Business)
6. Feature Engineering
7. Data analysis and visualization
8. Data Modelling
9. Data Loading

In [1]:
#Import necessary libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Data Extraction

In [36]:
# Extracting data from csv file
df = pd.read_csv(r"data\globex_retail_data.csv")

# Checking the first 5 rows
df.head(5)

,Customer_ID,Order_ID,Order_Date,Product_Category,Product_Sub_Category,Quantity,Price,Discount,Customer_Location,Revenue
0,CUST_013738,ORD_00102406,2023-01-01,Home & Garden,Gardening Tools,1,419.19,0.00,TN,419.1900
1,CUST_011726,ORD_00102902,2023-01-01,Electronics,Laptops,1,222.37,0.09,TN,202.3567
2,CUST_010891,ORD_00103864,2023-01-01,Electronics,Laptops,6,1107.65,0.00,IN,6645.9000
3,CUST_011452,ORD_00103560,2023-01-01,Electronics,Gaming Consoles,5,288.84,0.00,MA,1444.2000
4,CUST_010886,ORD_00100632,2023-01-02,Electronics,Headphones,1,191.27,0.00,AZ,191.2700

In [5]:
# Determine the number of rows and columns in the dataframe
df.shape

(5000, 10)

In [6]:
# Column names, null count and data type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           5000 non-null   object
 1   Order_ID              5000 non-null   object
 2   Order_Date            5000 non-null   object
 3   Product_Category      5000 non-null   object
 4   Product_Sub_Category  5000 non-null   object
 5   Quantity              5000 non-null   int64
 6   Price                 5000 non-null   float64
 7   Discount              5000 non-null   float64
 8   Customer_Location     5000 non-null   object
 9   Revenue               5000 non-null   float64
dtypes: float64(3), int64(1), object(6)
memory usage: 390.8+ KB

### Data Quality Assessment

##### Completeness - checking for null values

In [7]:
# checking for null values in the data
df.isnull().sum()

Customer_ID             0
Order_ID                0
Order_Date              0
Product_Category        0
Product_Sub_Category    0
Quantity                0
Price                   0
Discount                0
Customer_Location       0
Revenue                 0
dtype: int64

##### Uniqueness - checking for duplicates

In [9]:
df.duplicated().sum() # no duplicate values reported

np.int64(0)

In [10]:
# to check the number of unique values in the customer ID

df['Customer_ID'].nunique()

3203

In [11]:
# to check the number of unique values in the customer ID

df['Order_ID'].nunique()

5000

##### Inconsistency - checking for the values in each column

In [12]:
# show summary statistics for numerical columns to see the min, max and mean values
df.describe()

          Quantity        Price     Discount       Revenue
count  5000.000000  5000.000000  5000.000000   5000.000000
mean      2.368800   330.240118     0.063534    743.955115
std       1.704631   427.081790     0.118311   1328.413944
min       1.000000     8.000000     0.000000      6.164400
25%       1.000000    54.017500     0.000000     94.601000
50%       2.000000   149.770000     0.000000    264.530250
75%       3.000000   415.087500     0.090000    767.867500
max      10.000000  1997.860000     0.500000  13819.840000

In [ ]:
# check for values in the category column to ensure consistency
df.Product_Category.value_counts().sort_values(ascending=True)

Product_Category
Home & Garden    768
Beauty           821
Sports           826
Clothing         832
Books            871
Electronics      882
Name: count, dtype: int64

In [18]:
# check for values in the sub_category column to ensure consistency
df.Product_Sub_Category.value_counts().sort_values(ascending=True)

Product_Sub_Category
Kitchen Appliances    120
Makeup                121
Bedding               125
Storage               125
Outdoor Gear          127
Furniture             130
Shoes                 130
Headphones            132
Home Decor            132
Hair Care             133
Jeans                 133
Team Sports           133
Accessories           134
Educational           135
Laptops               136
Gardening Tools       136
Water Sports          136
Mens Shirts           136
Personal Care         137
Skincare              139
Magazines             139
Comics                139
Fitness Equipment     142
Fragrances            142
Winter Sports         143
Cycling               145
Children Books        146
Sportswear            148
Smartphones           148
Beauty Tools          149
Tablets               150
Womens Dresses        151
Non-Fiction           153
Smart Watches         156
Fiction               159
Gaming Consoles       160
Name: count, dtype: int64

In [ ]:
# Check to ensure each customer location is in a two-letter format
location_lenght = df['Customer_Location'].str.len()
location_lenght.value_counts()

Customer_Location
2    5000
Name: count, dtype: int64

### Data Cleaning/Transformation

In [22]:
# Create a copy of the dataset to preserve an original source of truth for reference.
df_clean = df.copy()

In [23]:
# Changing the date to the correct format
df_clean['Order_Date'] = pd.to_datetime(df_clean['Order_Date'])

In [24]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           5000 non-null   object
 1   Order_ID              5000 non-null   object
 2   Order_Date            5000 non-null   datetime64[ns]
 3   Product_Category      5000 non-null   object
 4   Product_Sub_Category  5000 non-null   object
 5   Quantity              5000 non-null   int64
 6   Price                 5000 non-null   float64
 7   Discount              5000 non-null   float64
 8   Customer_Location     5000 non-null   object
 9   Revenue               5000 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 390.8+ KB

### Data Validation (Business)

Field-level checks
(valid ranges, allowed values, data types).

Cross-field validation
(if Order_ID is not null , then Order Date must not be null).

Aggregate validation
(Numerical columns like quantity, price and total sales must be above 0. Revenue==Total sales based on the data).

Business rule consistency
(discounts cannot exceed 50% without approval flag).

In [ ]:
# field-level checks for numerical columns. Aggregrate validation shows price and quantity are above 0.
df_clean.describe()

,Order_Date,Quantity,Price,Discount,Revenue
count,5000,5000.000000,5000.000000,5000.000000,5000.000000
mean,2023-12-30 16:11:42.719999744,2.368800,330.240118,0.063534,743.955115
min,2023-01-01 00:00:00,1.000000,8.000000,0.000000,6.164400
25%,2023-07-04 18:00:00,1.000000,54.017500,0.000000,94.601000
50%,2024-01-02 12:00:00,2.000000,149.770000,0.000000,264.530250
75%,2024-06-23 00:00:00,3.000000,415.087500,0.090000,767.867500
max,2024-12-31 00:00:00,10.000000,1997.860000,0.500000,13819.840000
std,NaN,1.704631,427.081790,0.118311,1328.413944

In [30]:
# field-level check for  non-numeical columns
df_clean.describe(include=['object'])

,Customer_ID,Order_ID,Product_Category,Product_Sub_Category,Customer_Location
count,5000,5000,5000,5000,5000
unique,3203,5000,6,36,30
top,CUST_013392,ORD_00102406,Electronics,Gaming Consoles,IL
freq,6,1,882,160,191

In [45]:
# Based on business requirement. revenue should equal total sales. Checking that both values match, and if not, how many mismtaches
mismatch_count = (df_clean['Revenue'] != df_clean['Quantity'] * df_clean['Price']).sum()
print(f"Number of mismatches: {mismatch_count}")

Number of mismatches: 1688

In [49]:
# To validate the business rule consistency of no discount above 50%
(df_clean['Discount'] > 0.5).sum()

np.int64(0)

### Feature Engineering

### Data Modeling

In [57]:
# Customer dimension

customer = df_clean[['Customer_ID','Customer_Location']].copy().drop_duplicates().reset_index(drop=True)
customer.head()

   Customer_ID Customer_Location
0  CUST_013738                TN
1  CUST_011726                TN
2  CUST_010891                IN
3  CUST_011452                MA
4  CUST_010886                AZ

In [58]:
# Order dimension

order = df_clean[['Order_ID','Order_Date']].copy().drop_duplicates().reset_index(drop=True)
order.head()

       Order_ID Order_Date
0  ORD_00102406 2023-01-01
1  ORD_00102902 2023-01-01
2  ORD_00103864 2023-01-01
3  ORD_00103560 2023-01-01
4  ORD_00100632 2023-01-02

In [ ]:
# Product dimension

product = df_clean[['Product_Category','Product_Sub_Category']].copy().drop_duplicates().reset_index(drop=True)

# Creating a PK column for the product table by changing the index name and thereafter resetting it.
product.index.name = 'Product_ID'
product = product.reset_index()

product.head()

   Product_ID Product_Category Product_Sub_Category
0           0    Home & Garden      Gardening Tools
1           1      Electronics              Laptops
2           2      Electronics      Gaming Consoles
3           3      Electronics           Headphones
4           4         Clothing                Shoes

In [ ]:
# facts table

facts_table =